app/controllers/foos_controller.rb

SELECT "foos".* FROM "foos"
---
  def index
    @foos = Foo.all

INSERT INTO "foos" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "hello"], ["created_at", "2017-10-19 07:17:48.243893"], ["updated_at", "2017-10-19 07:17:48.243893"]]
---
  def create
    @foo = Foo.new(foo_params)

    if @foo.save

UPDATE "foos" SET "name" = $1, "updated_at" = $2 WHERE "foos"."id" = $3  [["name", "test0"], ["updated_at", "2017-10-19 07:36:49.440224"], ["id", 2]]
---
  def update
    if @foo.update(foo_params)

DELETE FROM "foos" WHERE "foos"."id" = $1  [["id", 10]]
---
  def destroy
    @foo.destroy

SELECT  "foos".* FROM "foos" WHERE "foos"."id" = $1 LIMIT 1  [["id", 10]]
---
    def set_foo
      @foo = Foo.find(params[:id])